Franklnir/xiaozhi-x-Chronchi-esp32c3-mini-/main/audio/audio_service.cc
    return true;
}

void AudioService::AudioInputTask() {
    while (true) {
        EventBits_t bits = xEventGroupWaitBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING |
            AS_EVENT_WAKE_WORD_RUNNING | AS_EVENT_AUDIO_PROCESSOR_RUNNING | AS_EVENT_LOOPBACK_RUNNING,
            pdFALSE, pdFALSE, portMAX_DELAY);

        if (service_stopped_) {
            break;
        }
        if (audio_input_need_warmup_) {
            audio_input_need_warmup_ = false;
            vTaskDelay(pdMS_TO_TICKS(120));
            continue;
        }

        /* Live monitor (mic -> speaker) */
        if (bits & AS_EVENT_LOOPBACK_RUNNING) {
            std::vector<int16_t> data;
            const int input_sample_rate = codec_->input_sample_rate();
            int samples = OPUS_FRAME_DURATION_MS * input_sample_rate / 1000;
            if (ReadAudioData(data, input_sample_rate, samples)) {
                // If input channels is 2, use the left channel
                if (codec_->input_channels() == 2) {
                    auto mono_data = std::vector<int16_t>(data.size() / 2);
                    for (size_t i = 0, j = 0; i < mono_data.size(); ++i, j += 2) {
                        mono_data[i] = data[j];
                    }
                    data = std::move(mono_data);
                }

                // Resample to output sample rate if needed
                if (codec_->output_sample_rate() != input_sample_rate) {
                    int target_size = output_resampler_.GetOutputSamples(data.size());
                    std::vector<int16_t> resampled(target_size);
                    output_resampler_.Process(data.data(), data.size(), resampled.data());
                    data = std::move(resampled);
                }

                // Simple low-pass filter + adaptive gain to suppress feedback
                const float lpf_alpha = 0.35f;
                float y = loopback_filter_state_;
                int32_t peak = 0;
                for (size_t i = 0; i < data.size(); ++i) {
                    y += lpf_alpha * (static_cast<float>(data[i]) - y);
                    int32_t v = static_cast<int32_t>(y);
                    if (v > std::numeric_limits<int16_t>::max()) {
                        v = std::numeric_limits<int16_t>::max();
                    } else if (v < std::numeric_limits<int16_t>::min()) {
                        v = std::numeric_limits<int16_t>::min();
                    }
                    data[i] = static_cast<int16_t>(v);
                    int32_t abs_v = v >= 0 ? v : -v;
                    if (abs_v > peak) {
                        peak = abs_v;
                    }
                }
                loopback_filter_state_ = y;

                if (peak > 12000) {
                    loopback_dynamic_gain_ *= 0.6f;
                } else if (peak < 3000 && loopback_dynamic_gain_ < 1.0f) {
                    loopback_dynamic_gain_ += 0.02f;
                }
                if (loopback_dynamic_gain_ < 0.2f) {
                    loopback_dynamic_gain_ = 0.2f;
                } else if (loopback_dynamic_gain_ > 1.0f) {
                    loopback_dynamic_gain_ = 1.0f;
                }

                const float effective_gain = loopback_gain_ * loopback_dynamic_gain_;
                if (effective_gain != 1.0f) {
                    const int32_t max_sample = std::numeric_limits<int16_t>::max();
                    const int32_t min_sample = std::numeric_limits<int16_t>::min();
                    for (size_t i = 0; i < data.size(); ++i) {
                        int32_t amplified = static_cast<int32_t>(data[i] * effective_gain);
                        if (amplified > max_sample) {
                            data[i] = static_cast<int16_t>(max_sample);
                        } else if (amplified < min_sample) {
                            data[i] = static_cast<int16_t>(min_sample);
                        } else {
                            data[i] = static_cast<int16_t>(amplified);
                        }
                    }
                }

                // Push to playback queue (drop if queue is full to keep latency low)
                std::lock_guard<std::mutex> lock(audio_queue_mutex_);
                if (audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE) {
                    auto task = std::make_unique<AudioTask>();
                    task->type = kAudioTaskTypeDecodeToPlaybackQueue;
                    task->timestamp = 0;
                    task->pcm = std::move(data);
                    audio_playback_queue_.push_back(std::move(task));
                    audio_queue_cv_.notify_all();
                }
            }
            continue;
        }

        /* Used for audio testing in NetworkConfiguring mode by clicking the BOOT button */
        if (bits & AS_EVENT_AUDIO_TESTING_RUNNING) {
            if (audio_testing_queue_.size() >= AUDIO_TESTING_MAX_DURATION_MS / OPUS_FRAME_DURATION_MS) {
                ESP_LOGW(TAG, "Audio testing queue is full, stopping audio testing");
                EnableAudioTesting(false);
                continue;
            }
            std::vector<int16_t> data;
            int samples = OPUS_FRAME_DURATION_MS * 16000 / 1000;
            if (ReadAudioData(data, 16000, samples)) {
                // If input channels is 2, we need to fetch the left channel data
                if (codec_->input_channels() == 2) {
                    auto mono_data = std::vector<int16_t>(data.size() / 2);
                    for (size_t i = 0, j = 0; i < mono_data.size(); ++i, j += 2) {
                        mono_data[i] = data[j];
                    }
                    data = std::move(mono_data);
                }
                PushTaskToEncodeQueue(kAudioTaskTypeEncodeToTestingQueue, std::move(data));
                continue;
            }
        }

        /* Feed the wake word */
        if (bits & AS_EVENT_WAKE_WORD_RUNNING) {
            std::vector<int16_t> data;
            int samples = wake_word_->GetFeedSize();
            if (samples > 0) {
                if (ReadAudioData(data, 16000, samples)) {
                    wake_word_->Feed(data);
                    continue;
                }
            }
        }

        /* Feed the audio processor */
        if (bits & AS_EVENT_AUDIO_PROCESSOR_RUNNING) {
            std::vector<int16_t> data;
            int samples = audio_processor_->GetFeedSize();
            if (samples > 0) {
                if (ReadAudioData(data, 16000, samples)) {
                    audio_processor_->Feed(std::move(data));
                    continue;
                }
            }
        }

        // The state task can switch from wake-word detection to voice
        // processing between xEventGroupWaitBits() and this point. Retry the
        // wait instead of terminating the only audio-input task.
        ESP_LOGD(TAG, "Audio input mode changed while processing bits: %lx", bits);
        vTaskDelay(1);
    }

    ESP_LOGW(TAG, "Audio input task stopped");
}

void AudioService::AudioOutputTask() {
    while (true) {
        std::unique_lock<std::mutex> lock(audio_queue_mutex_);
        audio_queue_cv_.wait(lock, [this]() { return !audio_playback_queue_.empty() || service_stopped_; });
        if (service_stopped_) {
            break;
        }

